Catalogs/ПакетыДокументовДля1САрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПакетыДокументовДля1САрхива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрифДоступаБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицоБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодразделениеБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицоБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбменаСАрхивом</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СотрудникБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДокументыБИА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИсторияОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаС1САрхивом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремениБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОбменаС1САрхивом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаВАрхивВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГотовКВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбнаруженыОшибкиПриВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбнаруженыОшибкиПриЗагрузкеВАрхив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбнаруженыОшибкиПриПроверкеВАрхиве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятВАрхив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СобытияОбменаС1САрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СобытияОбменаС1САрхивом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПакетыДокументовДля1САрхива/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбменСАрхивом.ДоступноРедактированиеПоСтатусу(Объект.СтатусОбменаСАрхивом, Истина) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	СтатусыОбмена = Перечисления.СтатусыОбменаС1САрхивом;
	ОбнаруженыОшибки = Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриВыгрузке
		Или Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриЗагрузкеВАрхив
		Или Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ОбнаруженыОшибкиПриПроверкеВАрхиве;
	
	СписокВыбораСтатуса = Элементы.СтатусОбменаСАрхивом.СписокВыбора;
	СписокВыбораСтатуса.Очистить();
	СписокВыбораСтатуса.Добавить(Объект.СтатусОбменаСАрхивом);
	Если Объект.СтатусОбменаСАрхивом = СтатусыОбмена.ГотовКВыгрузке Тогда
		СписокВыбораСтатуса.Добавить(СтатусыОбмена.НеГотовКВыгрузке);
	ИначеЕсли Объект.СтатусОбменаСАрхивом = СтатусыОбмена.НеГотовКВыгрузке Тогда
		СписокВыбораСтатуса.Добавить(СтатусыОбмена.ГотовКВыгрузке);
	ИначеЕсли ОбнаруженыОшибки Тогда
		СписокВыбораСтатуса.Добавить(СтатусыОбмена.ГотовКВыгрузке);
	КонецЕсли;
	
	// Результат проверки отображается только в случае ошибки.
	Элементы.ДекорацияРезультатПроверки.Видимость = ОбнаруженыОшибки;
	
	Элементы.ДатаСоздания.Видимость = ЗначениеЗаполнено(Объект.ДатаСоздания);
	Элементы.ДатаПередачи.Видимость = ЗначениеЗаполнено(Объект.ДатаПередачи);
	Элементы.ДатаПриемки.Видимость = ЗначениеЗаполнено(Объект.ДатаПриемки);
	
	ПометкиДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		Объект.Документы.Выгрузить().ВыгрузитьКолонку("Документ"), "ПометкаУдаления");
	Для Каждого Стр Из Объект.Документы Цикл
		Стр.ПометкаУдаления = ПометкиДокументов[Стр.Документ];
	КонецЦикла;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьИнформациюОбОшибкахОбмена();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияРезультатПроверкиНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РезультатПроверки) Тогда
		ПараметрыФормы = Новый Структура("РезультатПроверки, СтатусВыгрузкиВАрхив",
			Объект.РезультатПроверки, Объект.СтатусОбменаСАрхивом);
		ОткрытьФорму("Справочник.ПакетыДокументовДля1САрхива.Форма.ФормаРезультатПроверки", ПараметрыФормы, ЭтотОбъект);
	Иначе
		ПараметрыФормы = Новый Структура("ОбъектОбмена, ТипСобытий", Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.СобытияОбменаС1САрхивом.Ошибка"));
		ОткрытьФорму("РегистрСведений.ИсторияОбменаС1САрхивом.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбменаСАрхивомПриИзменении(Элемент)
	
	Если Объект.СтатусОбменаСАрхивом = ПредопределенноеЗначение(
			"Перечисление.СтатусыОбменаС1САрхивом.ГотовКВыгрузке") Тогда
		Объект.Передал = ОбменСАрхивомВызовСервера.ФизЛицоТекущегоПользователя();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументы

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент = Элементы.ДокументыДокумент Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.ДокументыОшибкиОбмена Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ОшибкиОбмена) Тогда
			ПараметрыФормы = Новый Структура("ОбъектОбмена", ТекущиеДанные.Документ);
			ОткрытьФорму("РегистрСведений.ИсторияОбменаС1САрхивом.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДокументыДокумент");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Документы.ПометкаУдаления");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементШрифтОформления = ЭлементОформления.Оформление.Элементы.Найти("Шрифт");
	ЭлементШрифтОформления.Значение = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,,,,Истина);
	ЭлементШрифтОформления.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОбОшибкахОбмена()
	
	СтатусыОбмена = Перечисления.СтатусыОбменаС1САрхивом;
	Если Объект.СтатусОбменаСАрхивом <> СтатусыОбмена.ОбнаруженыОшибкиПриВыгрузке
			И Объект.СтатусОбменаСАрхивом <> СтатусыОбмена.ОбнаруженыОшибкиПриЗагрузкеВАрхив Тогда
		Возврат;
	КонецЕсли;
	
	ОтметкаНачалаПоследнегоОбмена = "";
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(История.ОтметкаВремени), &ПустаяОтметка) КАК ОтметкаВремени
		|ИЗ
		|	РегистрСведений.ИсторияОбменаС1САрхивом КАК История
		|ГДЕ
		|	История.ОсновнойОбъект = &Ссылка
		|	И История.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.СобытияОбменаС1САрхивом.ОкончаниеОбмена)");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПустаяОтметка", ОбменСАрхивом.ОтметкаВремениПоДате(Дата(2000,1,1)));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОтметкаНачалаПоследнегоОбмена = Выборка.ОтметкаВремени;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	История.Объект КАК Документ,
		|	КОЛИЧЕСТВО(1) КАК КолОшибок
		|ИЗ
		|	РегистрСведений.ИсторияОбменаС1САрхивом КАК История
		|ГДЕ
		|	История.ОсновнойОбъект = &ОсновнойОбъект
		|	И История.Объект В(&Объекты)
		|	И История.ОтметкаВремени > &ОтметкаНачалаПоследнегоОбмена
		|	И История.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.СобытияОбменаС1САрхивом.Ошибка)
		|
		|СГРУППИРОВАТЬ ПО
		|	История.Объект");
	Запрос.УстановитьПараметр("ОсновнойОбъект", Объект.Ссылка);
	Запрос.УстановитьПараметр("Объекты", Объект.Документы.Выгрузить().ВыгрузитьКолонку("Документ"));
	Запрос.УстановитьПараметр("ОтметкаНачалаПоследнегоОбмена", ОтметкаНачалаПоследнегоОбмена);
	КолОшибокПоДокументам = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КолОшибокПоДокументам[Выборка.Документ] = Выборка.КолОшибок;
	КонецЦикла;
	Для Каждого Стр Из Объект.Документы Цикл
		КолОшибок = КолОшибокПоДокументам[Стр.Документ];
		Если КолОшибок = Неопределено Или КолОшибок = 0 Тогда
			Продолжить;
		КонецЕсли;
		ПрописьЧислаИТекста = ЧислоПрописью(КолОшибок,, НСтр("ru = 'ошибка,ошибки,ошибок,,,,,,0'"));
		ПрописьЧисла = ЧислоПрописью(КолОшибок,, НСтр("ru = ',,,,,,,,0'"));
		Стр.ОшибкиОбмена = СтрЗаменить(ПрописьЧислаИТекста,
			ПрописьЧисла, Формат(КолОшибок, "ЧГ=") + " ");
	КонецЦикла;
	Элементы.ДокументыОшибкиОбмена.ПоложениеЗаголовка = ?(Выборка.Количество() > 0,
		ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет);
	
КонецПроцедуры

#КонецОбласти
